#k    Nk
10001 72
10000 67
9999 66
9998 65
9997 77
9996 74
9995 62
9994 69
9993 86
9992 85
9991 71
9990 65
9989 73
9988 77
9987 61
9986 48
9985 74
9984 78
9983 69
9982 69
9981 54
9980 58
9979 68
9978 72
9977 60
9976 64
9975 53
9974 66
9973 77
9972 61
9971 70
9970 51
9969 58
9968 56
9967 65
9966 44
9965 57
9964 53
9963 56
9962 67
9961 61
9960 63
9959 59
9958 40
9957 62
9956 54
9955 48
9954 52
9953 55
9952 56
9951 54
9950 63
9949 66
9948 62
9947 70
9946 58
9945 51
9944 72
9943 43
9942 39
9941 52
9940 63
9939 72
9938 58
9937 57
9936 56
9935 52
9934 49
9933 48
9932 60
9931 61
9930 48
9929 63
9928 75
9927 58
9926 57
9925 59
9924 66
9923 58
9922 35
9921 62
9920 52
9919 67
9918 60
9917 59
9916 42
9915 53
9914 46
9913 51
9912 66
9911 62
9910 69
9909 52
9908 52
9907 55
9906 56
9905 66
9904 58
9903 71
9902 54
9901 52
9900 57
9899 57
9898 64
9897 63
9896 52
9895 61
9894 64
9893 65
9892 52
9891 50
9890 73
9889 57
9888 60
9887 55
9886 66
9885 64
9884 52
9883 68
9882 63
9881 84
9880 49
9879 54
9878 55
9877 57
9876 53
9875 76
9874 52
9873 60
9872 68
9871 59
9870 62
9869 67
9868 67
9867 49
9866 54
9865 56
9864 57
9863 84
9862 61
9861 68
9860 60
9859 51
9858 68
9857 77
9856 51
9855 59
9854 63
9853 49
9852 69
9851 80
9850 61
9849 66
9848 67
9847 55
9846 58
9845 65
9844 65
9843 58
9842 54
9841 54
9840 57
9839 46
9838 67
9837 58
9836 50
9835 73
9834 64
9833 47
9832 57
9831 67
9830 72
9829 55
9828 52
9827 70
9826 61
9825 86
9824 67
9823 66
9822 44
9821 67
9820 59
9819 61
9818 51
9817 77
9816 74
9815 57
9814 57
9813 70
9812 68
9811 58
9810 66
9809 74
9808 57
9807 56
9806 73
9805 77
9804 61
9803 58
9802 69
9801 60
9800 42
9799 67
9798 65
9797 51
9796 62
9795 50
9794 64
9793 73
9792 55
9791 58
9790 80
9789 62
9788 61
9787 74
9786 61
9785 74
9784 61
9783 61
9782 71
9781 63
9780 57
9779 46
9778 59
9777 72
9776 63
9775 53
9774 58
9773 74
9772 59
9771 66
9770 73
9769 57
9768 80
9767 74
9766 44
9765 61
9764 58
9763 65
9762 54
9761 72
9760 50
9759 75
9758 63
9757 61
9756 58
9755 51
9754 82
9753 71
9752 67
9751 77
9750 52
9749 63
9748 60
9747 67
9746 82
9745 80
9744 71
9743 81
9742 68
9741 59
9740 79
9739 65
9738 62
9737 77
9736 77
9735 89
9734 61
9733 62
9732 56
9731 64
9730 65
9729 70
9728 68
9727 64
9726 69
9725 65
9724 69
9723 65
9722 61
9721 60
9720 61
9719 54
9718 57
9717 72
9716 62
9715 61
9714 66
9713 67
9712 45
9711 58
9710 60
9709 57
9708 56
9707 52
9706 70
9705 64
9704 73
9703 73
9702 81
9701 75
9700 63
9699 58
9698 55
9697 72
9696 71
9695 65
9694 75
9693 55
9692 68
9691 80
9690 58
9689 79
9688 81
9687 69
9686 54
9685 63
9684 66
9683 60
9682 70
9681 76
9680 62
9679 64
9678 53
9677 65
9676 75
9675 67
9674 72
9673 70
9672 50
9671 64
9670 60
9669 77
9668 58
9667 82
9666 52
9665 56
9664 56
9663 69
9662 63
9661 67
9660 65
9659 65
9658 66
9657 65
9656 65
9655 46
9654 66
9653 54
9652 63
9651 55
9650 74
9649 55
9648 49
9647 67
9646 64
9645 70
9644 55
9643 72
9642 58
9641 62
9640 61
9639 61
9638 57
9637 64
9636 69
9635 55
9634 58
9633 63
9632 49
9631 54
9630 57
9629 64
9628 46
9627 53
9626 49
9625 56
9624 58
9623 68
9622 60
9621 56
9620 60
9619 72
9618 67
9617 58
9616 52
9615 74
9614 62
9613 59
9612 74
9611 70
9610 60
9609 64
9608 69
9607 59
9606 60
9605 55
9604 59
9603 71
9602 56
9601 71
9600 72
9599 50
9598 75
9597 64
9596 60
9595 57
9594 62
9593 60
9592 65
9591 51
9590 77
9589 72
9588 62
9587 60
9586 51
9585 66
9584 53
9583 48
9582 64
9581 77
9580 62
9579 68
9578 49
9577 73
9576 69
9575 63
9574 60
9573 59
9572 61
9571 75
9570 56
9569 75
9568 54
9567 71
9566 66
9565 54
9564 70
9563 65
9562 62
9561 54
9560 60
9559 92
9558 69
9557 79
9556 59
9555 78
9554 68
9553 68
9552 69
9551 69
9550 72
9549 65
9548 56
9547 78
9546 67
9545 59
9544 85
9543 78
9542 57
9541 75
9540 84
9539 60
9538 54
9537 80
9536 75
9535 60
9534 57
9533 90
9532 64
9531 60
9530 62
9529 72
9528 61
9527 69
9526 56
9525 55
9524 62
9523 67
9522 73
9521 61
9520 65
9519 64
9518 58
9517 55
9516 66
9515 61
9514 56
9513 56
9512 66
9511 73
9510 59
9509 68
9508 57
9507 62
9506 64
9505 74
9504 70
9503 66
9502 61
9501 69
9500 51
9499 66
9498 76
9497 75
9496 63
9495 58
9494 68
9493 71
9492 79
9491 78
9490 68
9489 68
9488 71
9487 64
9486 73
9485 68
9484 55
9483 75
9482 72
9481 73
9480 62
9479 60
9478 74
9477 76
9476 58
9475 60
9474 70
9473 76
9472 86
9471 71
9470 64
9469 62
9468 62
9467 80
9466 73
9465 74
9464 52
9463 56
9462 78
9461 65
9460 71
9459 69
9458 67
9457 95
9456 61
9455 66
9454 78
9453 73
9452 77
9451 75
9450 69
9449 71
9448 63
9447 70
9446 68
9445 65
9444 65
9443 64
9442 72
9441 68
9440 83
9439 75
9438 72
9437 61
9436 73
9435 70
9434 62
9433 77
9432 92
9431 79
9430 78
9429 66
9428 68
9427 72
9426 61
9425 62
9424 61
9423 51
9422 69
9421 66
9420 67
9419 73
9418 66
9417 77
9416 63
9415 58
9414 62
9413 67
9412 53
9411 54
9410 70
9409 50
9408 81
9407 65
9406 57
9405 79
9404 55
9403 63
9402 53
9401 67
9400 66
9399 66
9398 61
9397 76
9396 61
9395 71
9394 69
9393 49
9392 58
9391 77
9390 67
9389 75
9388 51
9387 64
9386 53
9385 69
9384 74
9383 72
9382 52
9381 61
9380 51
9379 60
9378 59
9377 64
9376 81
9375 56
9374 75
9373 75
9372 52
9371 61
9370 68
9369 49
9368 68
9367 58
9366 65
9365 67
9364 67
9363 58
9362 62
9361 77
9360 59
9359 61
9358 57
9357 65
9356 57
9355 45
9354 72
9353 72
9352 57
9351 69
9350 52
9349 69
9348 57
9347 62
9346 67
9345 78
9344 69
9343 71
9342 60
9341 79
9340 98
9339 56
9338 62
9337 61
9336 76
9335 64
9334 73
9333 77
9332 63
9331 73
9330 72
9329 106
9328 63
9327 62
9326 63
9325 68
9324 65
9323 58
9322 61
9321 94
9320 74
9319 58
9318 63
9317 52
9316 64
9315 72
9314 66
9313 79
9312 73
9311 71
9310 67
9309 98
9308 69
9307 72
9306 97
9305 73
9304 69
9303 88
9302 94
9301 79
9300 59
9299 69
9298 65
9297 58
9296 66
9295 89
9294 78
9293 73
9292 67
9291 88
9290 64
9289 72
9288 73
9287 84
9286 80
9285 74
9284 69
9283 79
9282 66
9281 81
9280 78
9279 71
9278 71
9277 58
9276 59
9275 76
9274 71
9273 76
9272 79
9271 65
9270 62
9269 63
9268 60
9267 54
9266 54
9265 73
9264 67
9263 76
9262 66
9261 87
9260 76
9259 67
9258 57
9257 51
9256 76
9255 68
9254 69
9253 69
9252 68
9251 53
9250 70
9249 62
9248 76
9247 58
9246 69
9245 54
9244 70
9243 61
9242 76
9241 54
9240 59
9239 79
9238 67
9237 67
9236 70
9235 64
9234 62
9233 63
9232 71
9231 74
9230 79
9229 67
9228 71
9227 75
9226 78
9225 62
9224 71
9223 64
9222 73
9221 63
9220 76
9219 78
9218 59
9217 72
9216 75
9215 66
9214 81
9213 73
9212 68
9211 49
9210 75
9209 81
9208 69
9207 65
9206 53
9205 73
9204 60
9203 74
9202 77
9201 67
9200 67
9199 67
9198 67
9197 78
9196 90
9195 66
9194 68
9193 58
9192 82
9191 76
9190 67
9189 73
9188 66
9187 60
9186 70
9185 55
9184 68
9183 56
9182 53
9181 70
9180 68
9179 70
9178 57
9177 63
9176 67
9175 69
9174 62
9173 65
9172 73
9171 69
9170 67
9169 84
9168 53
9167 63
9166 64
9165 62
9164 69
9163 78
9162 63
9161 81
9160 50
9159 76
9158 69
9157 59
9156 64
9155 64
9154 78
9153 61
9152 48
9151 79
9150 72
9149 68
9148 68
9147 64
9146 55
9145 60
9144 74
9143 72
9142 64
9141 61
9140 72
9139 83
9138 66
9137 59
9136 78
9135 72
9134 74
9133 77
9132 71
9131 72
9130 69
9129 77
9128 61
9127 69
9126 66
9125 67
9124 66
9123 76
9122 64
9121 66
9120 63
9119 65
9118 65
9117 63
9116 57
9115 67
9114 63
9113 74
9112 69
9111 62
9110 72
9109 79
9108 64
9107 62
9106 71
9105 56
9104 65
9103 82
9102 81
9101 78
9100 55
9099 71
9098 56
9097 62
9096 78
9095 66
9094 70
9093 53
9092 77
9091 78
9090 69
9089 63
9088 76
9087 60
9086 75
9085 67
9084 69
9083 49
9082 73
9081 84
9080 78
9079 65
9078 60
9077 67
9076 79
9075 70
9074 84
9073 71
9072 76
9071 85
9070 71
9069 74
9068 81
9067 82
9066 80
9065 94
9064 84
9063 76
9062 71
9061 90
9060 66
9059 70
9058 67
9057 65
9056 66
9055 80
9054 89
9053 74
9052 76
9051 74
9050 66
9049 86
9048 84
9047 79
9046 89
9045 60
9044 76
9043 104
9042 72
9041 95
9040 69
9039 76
9038 69
9037 82
9036 84
9035 78
9034 65
9033 71
9032 84
9031 72
9030 63
9029 58
9028 73
9027 73
9026 57
9025 67
9024 73
9023 66
9022 60
9021 79
9020 69
9019 84
9018 64
9017 70
9016 61
9015 53
9014 76
9013 63
9012 68
9011 61
9010 76
9009 63
9008 80
9007 79
9006 81
9005 73
9004 69
9003 68
9002 72
9001 64
9000 73
8999 60
8998 70
8997 74
8996 63
8995 78
8994 63
8993 72
8992 79
8991 67
8990 75
8989 72
8988 62
8987 69
8986 59
8985 80
8984 82
8983 75
8982 85
8981 71
8980 58
8979 71
8978 67
8977 72
8976 72
8975 70
8974 77
8973 89
8972 77
8971 76
8970 86
8969 69
8968 65
8967 67
8966 59
8965 64
8964 71
8963 61
8962 71
8961 72
8960 69
8959 73
8958 61
8957 67
8956 63
8955 67
8954 72
8953 65
8952 71
8951 69
8950 62
8949 70
8948 72
8947 83
8946 59
8945 50
8944 65
8943 66
8942 72
8941 77
8940 69
8939 75
8938 71
8937 77
8936 66
8935 69
8934 61
8933 69
8932 72
8931 83
8930 60
8929 65
8928 77
8927 75
8926 71
8925 88
8924 71
8923 82
8922 66
8921 81
8920 54
8919 59
8918 56
8917 63
8916 63
8915 85
8914 83
8913 71
8912 84
8911 81
8910 66
8909 66
8908 83
8907 68
8906 71
8905 74
8904 73
8903 61
8902 71
8901 80
8900 76
8899 61
8898 49
8897 76
8896 52
8895 75
8894 75
8893 52
8892 79
8891 75
8890 70
8889 77
8888 77
8887 60
8886 59
8885 83
8884 79
8883 59
8882 67
8881 68
8880 96
8879 72
8878 64
8877 88
8876 66
8875 62
8874 89
8873 66
8872 69
8871 84
8870 66
8869 66
8868 71
8867 64
8866 69
8865 69
8864 63
8863 63
8862 65
8861 74
8860 79
8859 63
8858 72
8857 61
8856 58
8855 73
8854 79
8853 72
8852 64
8851 69
8850 69
8849 76
8848 62
8847 59
8846 62
8845 73
8844 72
8843 80
8842 79
8841 63
8840 75
8839 75
8838 61
8837 66
8836 89
8835 76
8834 78
8833 67
8832 79
8831 56
8830 86
8829 74
8828 86
8827 66
8826 75
8825 70
8824 82
8823 95
8822 81
8821 85
8820 78
8819 82
8818 79
8817 86
8816 68
8815 80
8814 74
8813 83
8812 79
8811 77
8810 76
8809 89
8808 73
8807 80
8806 94
8805 75
8804 67
8803 86
8802 94
8801 81
8800 77
8799 79
8798 86
8797 76
8796 100
8795 100
8794 86
8793 77
8792 85
8791 79
8790 84
8789 69
8788 82
8787 83
8786 95
8785 63
8784 79
8783 100
8782 86
8781 78
8780 89
8779 97
8778 94
8777 84
8776 75
8775 78
8774 82
8773 79
8772 73
8771 99
8770 75
8769 87
8768 72
8767 89
8766 86
8765 64
8764 76
8763 76
8762 85
8761 91
8760 73
8759 77
8758 91
8757 79
8756 78
8755 74
8754 70
8753 68
8752 63
8751 87
8750 73
8749 72
8748 68
8747 68
8746 88
8745 79
8744 66
8743 74
8742 62
8741 76
8740 79
8739 78
8738 77
8737 88
8736 78
8735 78
8734 50
8733 87
8732 69
8731 77
8730 74
8729 81
8728 68
8727 69
8726 78
8725 78
8724 66
8723 78
8722 61
8721 67
8720 84
8719 69
8718 66
8717 75
8716 68
8715 89
8714 80
8713 65
8712 66
8711 82
8710 52
8709 68
8708 78
8707 87
8706 77
8705 75
8704 74
8703 70
8702 75
8701 66
8700 69
8699 76
8698 73
8697 87
8696 96
8695 81
8694 77
8693 85
8692 78
8691 67
8690 81
8689 67
8688 73
8687 67
8686 83
8685 91
8684 58
8683 84
8682 87
8681 71
8680 99
8679 77
8678 150
8677 82
8676 68
8675 76
8674 82
8673 83
8672 73
8671 84
8670 48
8669 71
8668 54
8667 71
8666 69
8665 84
8664 72
8663 76
8662 81
8661 84
8660 71
8659 68
8658 81
8657 81
8656 75
8655 63
8654 74
8653 91
8652 75
8651 90
8650 88
8649 77
8648 72
8647 78
8646 67
8645 70
8644 67
8643 81
8642 81
8641 73
8640 83
8639 75
8638 78
8637 88
8636 76
8635 87
8634 62
8633 63
8632 71
8631 82
8630 58
8629 82
8628 75
8627 76
8626 81
8625 83
8624 71
8623 80
8622 73
8621 80
8620 78
8619 65
8618 67
8617 74
8616 90
8615 73
8614 85
8613 66
8612 95
8611 87
8610 68
8609 95
8608 77
8607 77
8606 62
8605 66
8604 77
8603 92
8602 84
8601 79
8600 74
8599 92
8598 66
8597 80
8596 76
8595 80
8594 73
8593 79
8592 63
8591 80
8590 77
8589 65
8588 71
8587 89
8586 80
8585 60
8584 74
8583 76
8582 73
8581 83
8580 74
8579 79
8578 74
8577 82
8576 83
8575 86
8574 67
8573 69
8572 71
8571 65
8570 60
8569 70
8568 86
8567 75
8566 76
8565 71
8564 79
8563 84
8562 87
8561 90
8560 86
8559 90
8558 82
8557 81
8556 94
8555 69
8554 73
8553 78
8552 106
8551 78
8550 89
8549 88
8548 72
8547 73
8546 78
8545 76
8544 80
8543 94
8542 99
8541 81
8540 83
8539 88
8538 86
8537 74
8536 84
8535 89
8534 101
8533 77
8532 74
8531 86
8530 81
8529 102
8528 74
8527 78
8526 94
8525 91
8524 79
8523 80
8522 78
8521 70
8520 76
8519 98
8518 78
8517 94
8516 77
8515 85
8514 87
8513 87
8512 74
8511 74
8510 73
8509 74
8508 98
8507 78
8506 71
8505 88
8504 74
8503 82
8502 71
8501 66
8500 67
8499 63
8498 75
8497 85
8496 78
8495 81
8494 86
8493 80
8492 75
8491 68
8490 79
8489 70
8488 76
8487 77
8486 79
8485 68
8484 93
8483 66
8482 79
8481 74
8480 106
8479 73
8478 75
8477 73
8476 75
8475 69
8474 82
8473 73
8472 68
8471 70
8470 80
8469 64
8468 70
8467 94
8466 68
8465 81
8464 79
8463 81
8462 101
8461 70
8460 80
8459 74
8458 74
8457 80
8456 76
8455 80
8454 87
8453 70
8452 81
8451 76
8450 65
8449 82
8448 69
8447 90
8446 75
8445 72
8444 74
8443 98
8442 100
8441 71
8440 76
8439 70
8438 82
8437 69
8436 95
8435 80
8434 68
8433 73
8432 64
8431 78
8430 87
8429 93
8428 166
8427 74
8426 79
8425 82
8424 79
8423 66
8422 66
8421 82
8420 78
8419 70
8418 68
8417 72
8416 82
8415 84
8414 75
8413 73
8412 63
8411 79
8410 59
8409 70
8408 64
8407 87
8406 77
8405 73
8404 69
8403 84
8402 85
8401 80
8400 78
8399 72
8398 82
8397 72
8396 74
8395 79
8394 81
8393 78
8392 96
8391 71
8390 75
8389 82
8388 91
8387 80
8386 74
8385 90
8384 83
8383 88
8382 83
8381 76
8380 103
8379 67
8378 80
8377 89
8376 84
8375 73
8374 85
8373 83
8372 76
8371 64
8370 88
8369 86
8368 80
8367 81
8366 83
8365 72
8364 85
8363 85
8362 84
8361 80
8360 83
8359 82
8358 74
8357 87
8356 77
8355 80
8354 92
8353 63
8352 82
8351 73
8350 97
8349 72
8348 87
8347 87
8346 70
8345 74
8344 57
8343 76
8342 79
8341 81
8340 75
8339 77
8338 79
8337 109
8336 83
8335 80
8334 71
8333 91
8332 99
8331 83
8330 97
8329 82
8328 97
8327 94
8326 77
8325 70
8324 60
8323 70
8322 102
8321 85
8320 72
8319 84
8318 86
8317 80
8316 70
8315 64
8314 82
8313 84
8312 83
8311 82
8310 78
8309 92
8308 88
8307 87
8306 83
8305 85
8304 85
8303 73
8302 94
8301 85
8300 81
8299 91
8298 84
8297 64
8296 76
8295 82
8294 89
8293 74
8292 75
8291 93
8290 75
8289 75
8288 63
8287 98
8286 87
8285 80
8284 79
8283 89
8282 86
8281 83
8280 80
8279 74
8278 84
8277 78
8276 71
8275 90
8274 76
8273 68
8272 88
8271 70
8270 84
8269 85
8268 74
8267 117
8266 78
8265 80
8264 77
8263 78
8262 70
8261 75
8260 86
8259 67
8258 83
8257 81
8256 70
8255 90
8254 92
8253 69
8252 59
8251 78
8250 64
8249 79
8248 65
8247 78
8246 86
8245 69
8244 75
8243 89
8242 76
8241 77
8240 87
8239 82
8238 68
8237 78
8236 82
8235 94
8234 84
8233 89
8232 80
8231 65
8230 70
8229 73
8228 85
8227 82
8226 68
8225 73
8224 91
8223 83
8222 85
8221 77
8220 82
8219 90
8218 85
8217 74
8216 61
8215 75
8214 80
8213 80
8212 71
8211 80
8210 77
8209 80
8208 84
8207 82
8206 87
8205 77
8204 82
8203 90
8202 73
8201 85
8200 69
8199 75
8198 92
8197 68
8196 75
8195 89
8194 85
8193 69
8192 80
8191 85
8190 89
8189 78
8188 86
8187 80
8186 75
8185 82
8184 76
8183 92
8182 77
8181 97
8180 77
8179 95
8178 81
8177 85
8176 80
8175 83
8174 78
8173 78
8172 91
8171 91
8170 67
8169 85
8168 72
8167 83
8166 83
8165 80
8164 75
8163 81
8162 93
8161 76
8160 80
8159 84
8158 90
8157 81
8156 75
8155 83
8154 75
8153 69
8152 107
8151 94
8150 88
8149 73
8148 86
8147 101
8146 66
8145 85
8144 87
8143 82
8142 84
8141 73
8140 90
8139 80
8138 103
8137 86
8136 75
8135 101
8134 73
8133 88
8132 80
8131 84
8130 80
8129 92
8128 88
8127 90
8126 81
8125 75
8124 75
8123 81
8122 103
8121 74
8120 90
8119 81
8118 90
8117 78
8116 81
8115 90
8114 83
8113 95
8112 93
8111 89
8110 89
8109 83
8108 89
8107 71
8106 95
8105 73
8104 107
8103 94
8102 69
8101 77
8100 88
8099 75
8098 98
8097 90
8096 86
8095 69
8094 83
8093 79
8092 97
8091 88
8090 81
8089 81
8088 80
8087 105
8086 80
8085 74
8084 78
8083 84
8082 110
8081 86
8080 87
8079 84
8078 92
8077 83
8076 67
8075 86
8074 94
8073 75
8072 88
8071 97
8070 109
8069 87
8068 83
8067 83
8066 86
8065 78
8064 90
8063 90
8062 97
8061 86
8060 91
8059 71
8058 94
8057 73
8056 105
8055 86
8054 87
8053 89
8052 97
8051 98
8050 79
8049 83
8048 79
8047 89
8046 82
8045 91
8044 77
8043 79
8042 80
8041 93
8040 85
8039 73
8038 86
8037 84
8036 78
8035 62
8034 90
8033 82
8032 87
8031 83
8030 92
8029 90
8028 80
8027 90
8026 87
8025 77
8024 108
8023 70
8022 89
8021 96
8020 87
8019 100
8018 82
8017 75
8016 69
8015 78
8014 91
8013 92
8012 91
8011 75
8010 68
8009 96
8008 83
8007 80
8006 84
8005 78
8004 76
8003 69
8002 73
8001 79
8000 92
7999 85
7998 96
7997 94
7996 68
7995 90
7994 95
7993 90
7992 82
7991 92
7990 99
7989 89
7988 84
7987 87
7986 69
7985 67
7984 85
7983 89
7982 75
7981 83
7980 99
7979 82
7978 85
7977 91
7976 90
7975 101
7974 87
7973 91
7972 93
7971 88
7970 63
7969 92
7968 83
7967 80
7966 79
7965 102
7964 73
7963 85
7962 95
7961 89
7960 84
7959 93
7958 86
7957 84
7956 85
7955 84
7954 97
7953 103
7952 98
7951 94
7950 93
7949 81
7948 83
7947 83
7946 81
7945 67
7944 82
7943 81
7942 74
7941 83
7940 67
7939 82
7938 77
7937 100
7936 88
7935 82
7934 97
7933 79
7932 86
7931 79
7930 101
7929 88
7928 96
7927 85
7926 86
7925 87
7924 84
7923 104
7922 99
7921 95
7920 81
7919 78
7918 87
7917 97
7916 84
7915 92
7914 87
7913 86
7912 106
7911 91
7910 86
7909 69
7908 86
7907 80
7906 83
7905 85
7904 99
7903 80
7902 86
7901 82
7900 80
7899 74
7898 86
7897 80
7896 92
7895 96
7894 94
7893 84
7892 79
7891 78
7890 77
7889 101
7888 102
7887 85
7886 98
7885 78
7884 81
7883 95
7882 101
7881 94
7880 76
7879 75
7878 82
7877 86
7876 90
7875 72
7874 95
7873 85
7872 96
7871 97
7870 90
7869 82
7868 91
7867 85
7866 99
7865 106
7864 93
7863 93
7862 90
7861 72
7860 91
7859 98
7858 64
7857 93
7856 73
7855 91
7854 76
7853 85
7852 70
7851 83
7850 99
7849 89
7848 69
7847 88
7846 100
7845 85
7844 107
7843 90
7842 71
7841 91
7840 93
7839 82
7838 95
7837 91
7836 91
7835 88
7834 88
7833 89
7832 79
7831 81
7830 92
7829 76
7828 83
7827 91
7826 76
7825 82
7824 81
7823 87
7822 105
7821 98
7820 88
7819 101
7818 85
7817 76
7816 84
7815 88
7814 78
7813 88
7812 92
7811 86
7810 85
7809 121
7808 98
7807 87
7806 94
7805 90
7804 74
7803 86
7802 94
7801 87
7800 93
7799 94
7798 85
7797 81
7796 87
7795 87
7794 102
7793 69
7792 94
7791 85
7790 83
7789 87
7788 99
7787 106
7786 101
7785 95
7784 124
7783 91
7782 92
7781 95
7780 91
7779 89
7778 106
7777 97
7776 92
7775 78
7774 102
7773 76
7772 105
7771 103
7770 93
7769 88
7768 108
7767 75
7766 89
7765 99
7764 92
7763 86
7762 99
7761 97
7760 93
7759 93
7758 114
7757 92
7756 92
7755 79
7754 97
7753 91
7752 77
7751 92
7750 82
7749 107
7748 86
7747 100
7746 93
7745 93
7744 93
7743 93
7742 83
7741 99
7740 94
7739 96
7738 87
7737 93
7736 102
7735 101
7734 72
7733 96
7732 90
7731 83
7730 75
7729 96
7728 118
7727 126
7726 432
7725 96
7724 74
7723 89
7722 86
7721 81
7720 94
7719 88
7718 106
7717 84
7716 84
7715 91
7714 85
7713 82
7712 93
7711 99
7710 101
7709 92
7708 95
7707 89
7706 94
7705 77
7704 93
7703 107
7702 84
7701 94
7700 99
7699 106
7698 107
7697 92
7696 85
7695 96
7694 97
7693 97
7692 81
7691 84
7690 91
7689 91
7688 86
7687 87
7686 88
7685 99
7684 87
7683 114
7682 93
7681 69
7680 105
7679 82
7678 93
7677 74
7676 103
7675 102
7674 77
7673 84
7672 97
7671 100
7670 73
7669 84
7668 97
7667 103
7666 97
7665 96
7664 77
7663 105
7662 102
7661 86
7660 80
7659 86
7658 87
7657 86
7656 93
7655 94
7654 85
7653 102
7652 82
7651 80
7650 104
7649 100
7648 91
7647 99
7646 77
7645 93
7644 93
7643 89
7642 85
7641 75
7640 84
7639 105
7638 95
7637 100
7636 94
7635 86
7634 104
7633 111
7632 86
7631 97
7630 92
7629 84
7628 88
7627 101
7626 91
7625 101
7624 97
7623 101
7622 95
7621 90
7620 96
7619 92
7618 100
7617 96
7616 96
7615 93
7614 89
7613 81
7612 86
7611 85
7610 107
7609 104
7608 85
7607 99
7606 72
7605 108
7604 90
7603 101
7602 109
7601 104
7600 87
7599 101
7598 87
7597 79
7596 97
7595 99
7594 109
7593 87
7592 93
7591 83
7590 89
7589 97
7588 108
7587 76
7586 82
7585 104
7584 95
7583 116
7582 113
7581 83
7580 96
7579 98
7578 101
7577 96
7576 99
7575 105
7574 79
7573 105
7572 83
7571 119
7570 87
7569 89
7568 103
7567 95
7566 97
7565 96
7564 104
7563 94
7562 93
7561 92
7560 77
7559 97
7558 83
7557 98
7556 88
7555 92
7554 93
7553 104
7552 96
7551 92
7550 108
7549 112
7548 101
7547 89
7546 85
7545 108
7544 105
7543 90
7542 97
7541 93
7540 97
7539 90
7538 95
7537 96
7536 93
7535 90
7534 94
7533 111
7532 106
7531 87
7530 93
7529 101
7528 104
7527 107
7526 102
7525 106
7524 98
7523 85
7522 105
7521 93
7520 82
7519 95
7518 105
7517 105
7516 105
7515 94
7514 93
7513 120
7512 102
7511 87
7510 95
7509 116
7508 93
7507 74
7506 108
7505 108
7504 100
7503 90
7502 89
7501 94
7500 98
7499 90
7498 110
7497 122
7496 88
7495 112
7494 108
7493 96
7492 99
7491 96
7490 101
7489 120
7488 91
7487 89
7486 91
7485 105
7484 111
7483 101
7482 91
7481 93
7480 107
7479 104
7478 83
7477 91
7476 94
7475 110
7474 102
7473 119
7472 103
7471 106
7470 85
7469 111
7468 119
7467 121
7466 110
7465 101
7464 94
7463 123
7462 93
7461 113
7460 89
7459 110
7458 105
7457 109
7456 102
7455 111
7454 69
7453 99
7452 103
7451 126
7450 83
7449 113
7448 100
7447 92
7446 91
7445 124
7444 104
7443 97
7442 100
7441 108
7440 98
7439 109
7438 98
7437 98
7436 102
7435 110
7434 108
7433 104
7432 98
7431 103
7430 90
7429 112
7428 109
7427 87
7426 98
7425 117
7424 101
7423 119
7422 110
7421 116
7420 100
7419 128
7418 115
7417 122
7416 111
7415 118
7414 82
7413 109
7412 102
7411 120
7410 98
7409 120
7408 101
7407 95
7406 112
7405 99
7404 83
7403 111
7402 96
7401 126
7400 108
7399 120
7398 86
7397 125
7396 117
7395 119
7394 103
7393 115
7392 81
7391 96
7390 103
7389 113
7388 102
7387 121
7386 108
7385 93
7384 96
7383 116
7382 93
7381 110
7380 91
7379 114
7378 103
7377 125
7376 96
7375 98
7374 91
7373 114
7372 91
7371 120
7370 102
7369 132
7368 112
7367 112
7366 114
7365 111
7364 111
7363 103
7362 113
7361 103
7360 111
7359 97
7358 110
7357 104
7356 91
7355 116
7354 93
7353 112
7352 96
7351 97
7350 84
7349 138
7348 94
7347 124
7346 105
7345 109
7344 90
7343 97
7342 131
7341 110
7340 119
7339 125
7338 125
7337 112
7336 121
7335 102
7334 103
7333 127
7332 91
7331 104
7330 106
7329 104
7328 125
7327 122
7326 84
7325 117
7324 109
7323 137
7322 90
7321 106
7320 106
7319 115
7318 94
7317 119
7316 94
7315 106
7314 95
7313 112
7312 99
7311 110
7310 110
7309 109
7308 114
7307 116
7306 102
7305 125
7304 96
7303 109
7302 99
7301 113
7300 104
7299 106
7298 97
7297 99
7296 91
7295 129
7294 94
7293 100
7292 108
7291 107
7290 108
7289 104
7288 101
7287 102
7286 85
7285 100
7284 88
7283 114
7282 115
7281 118
7280 95
7279 134
7278 99
7277 121
7276 99
7275 111
7274 100
7273 114
7272 118
7271 111
7270 109
7269 184
7268 104
7267 106
7266 103
7265 122
7264 101
7263 117
7262 127
7261 112
7260 94
7259 96
7258 100
7257 110
7256 95
7255 106
7254 99
7253 98
7252 111
7251 107
7250 109
7249 114
7248 95
7247 128
7246 94
7245 107
7244 97
7243 99
7242 102
7241 110
7240 105
7239 104
7238 108
7237 107
7236 108
7235 88
7234 109
7233 103
7232 100
7231 121
7230 109
7229 103
7228 105
7227 108
7226 114
7225 129
7224 112
7223 122
7222 99
7221 116
7220 104
7219 113
7218 99
7217 107
7216 115
7215 101
7214 102
7213 89
7212 117
7211 122
7210 106
7209 100
7208 119
7207 116
7206 103
7205 115
7204 107
7203 122
7202 100
7201 125
7200 110
7199 108
7198 107
7197 134
7196 115
7195 116
7194 116
7193 109
7192 99
7191 102
7190 103
7189 99
7188 116
7187 113
7186 115
7185 98
7184 92
7183 120
7182 102
7181 112
7180 113
7179 105
7178 110
7177 108
7176 110
7175 127
7174 113
7173 128
7172 108
7171 111
7170 89
7169 97
7168 104
7167 106
7166 109
7165 100
7164 107
7163 125
7162 100
7161 119
7160 102
7159 121
7158 117
7157 125
7156 105
7155 111
7154 106
7153 129
7152 114
7151 100
7150 96
7149 95
7148 110
7147 114
7146 107
7145 109
7144 115
7143 118
7142 90
7141 106
7140 87
7139 115
7138 98
7137 113
7136 101
7135 110
7134 99
7133 102
7132 118
7131 98
7130 127
7129 111
7128 91
7127 113
7126 103
7125 116
7124 104
7123 107
7122 94
7121 119
7120 125
7119 90
7118 123
7117 124
7116 112
7115 118
7114 106
7113 123
7112 115
7111 102
7110 119
7109 117
7108 102
7107 98
7106 99
7105 111
7104 106
7103 109
7102 100
7101 108
7100 114
7099 120
7098 98
7097 125
7096 131
7095 125
7094 112
7093 114
7092 119
7091 113
7090 107
7089 110
7088 103
7087 116
7086 107
7085 108
7084 116
7083 126
7082 141
7081 116
7080 118
7079 109
7078 112
7077 122
7076 137
7075 108
7074 117
7073 112
7072 94
7071 112
7070 94
7069 105
7068 104
7067 115
7066 127
7065 125
7064 114
7063 111
7062 110
7061 100
7060 104
7059 125
7058 113
7057 117
7056 126
7055 130
7054 126
7053 99
7052 116
7051 106
7050 119
7049 97
7048 112
7047 105
7046 95
7045 108
7044 139
7043 91
7042 103
7041 112
7040 96
7039 97
7038 125
7037 123
7036 130
7035 114
7034 104
7033 113
7032 133
7031 116
7030 122
7029 115
7028 106
7027 120
7026 106
7025 123
7024 97
7023 99
7022 111
7021 120
7020 98
7019 126
7018 121
7017 121
7016 110
7015 125
7014 102
7013 120
7012 126
7011 112
7010 127
7009 125
7008 105
7007 93
7006 109
7005 107
7004 88
7003 110
7002 106
7001 114
7000 109
6999 113
6998 120
6997 128
6996 103
6995 112
6994 102
6993 105
6992 117
6991 101
6990 106
6989 131
6988 101
6987 128
6986 133
6985 139
6984 119
6983 128
6982 92
6981 115
6980 129
6979 120
6978 120
6977 109
6976 127
6975 118
6974 103
6973 112
6972 89
6971 123
6970 109
6969 122
6968 118
6967 112
6966 101
6965 105
6964 111
6963 132
6962 108
6961 118
6960 112
6959 108
6958 107
6957 102
6956 82
6955 121
6954 111
6953 120
6952 113
6951 149
6950 107
6949 100
6948 112
6947 119
6946 119
6945 103
6944 126
6943 127
6942 113
6941 115
6940 107
6939 125
6938 110
6937 107
6936 111
6935 131
6934 131
6933 134
6932 114
6931 100
6930 99
6929 124
6928 127
6927 122
6926 111
6925 117
6924 111
6923 112
6922 122
6921 115
6920 120
6919 103
6918 126
6917 129
6916 116
6915 122
6914 126
6913 126
6912 108
6911 108
6910 113
6909 117
6908 110
6907 117
6906 129
6905 127
6904 120
6903 123
6902 92
6901 108
6900 101
6899 112
6898 114
6897 136
6896 113
6895 104
6894 110
6893 130
6892 114
6891 143
6890 115
6889 105
6888 101
6887 111
6886 104
6885 122
6884 109
6883 116
6882 114
6881 100
6880 107
6879 103
6878 109
6877 106
6876 117
6875 107
6874 133
6873 95
6872 112
6871 131
6870 127
6869 113
6868 110
6867 136
6866 114
6865 116
6864 108
6863 110
6862 108
6861 116
6860 120
6859 110
6858 107
6857 128
6856 104
6855 133
6854 112
6853 115
6852 105
6851 117
6850 109
6849 122
6848 105
6847 123
6846 116
6845 109
6844 116
6843 121
6842 123
6841 131
6840 109
6839 109
6838 112
6837 123
6836 100
6835 135
6834 114
6833 125
6832 106
6831 112
6830 92
6829 103
6828 116
6827 123
6826 103
6825 129
6824 106
6823 104
6822 105
6821 108
6820 117
6819 114
6818 133
6817 122
6816 94
6815 118
6814 108
6813 113
6812 120
6811 117
6810 108
6809 132
6808 123
6807 126
6806 111
6805 117
6804 114
6803 102
6802 110
6801 133
6800 138
6799 133
6798 109
6797 122
6796 104
6795 130
6794 121
6793 113
6792 160
6791 124
6790 121
6789 96
6788 117
6787 118
6786 93
6785 109
6784 109
6783 126
6782 128
6781 119
6780 111
6779 121
6778 107
6777 111
6776 130
6775 128
6774 136
6773 116
6772 124
6771 123
6770 109
6769 124
6768 115
6767 134
6766 125
6765 106
6764 122
6763 116
6762 130
6761 143
6760 129
6759 115
6758 116
6757 117
6756 112
6755 119
6754 119
6753 124
6752 109
6751 123
6750 134
6749 119
6748 128
6747 129
6746 125
6745 111
6744 122
6743 115
6742 118
6741 111
6740 119
6739 133
6738 108
6737 102
6736 102
6735 118
6734 109
6733 103
6732 116
6731 118
6730 127
6729 122
6728 122
6727 100
6726 135
6725 127
6724 139
6723 112
6722 140
6721 122
6720 125
6719 169
6718 128
6717 118
6716 120
6715 122
6714 111
6713 117
6712 114
6711 135
6710 107
6709 113
6708 116
6707 122
6706 121
6705 115
6704 119
6703 122
6702 123
6701 145
6700 144
6699 112
6698 110
6697 111
6696 121
6695 119
6694 108
6693 144
6692 129
6691 123
6690 126
6689 129
6688 118
6687 124
6686 141
6685 116
6684 98
6683 101
6682 112
6681 119
6680 120
6679 126
6678 117
6677 125
6676 125
6675 116
6674 118
6673 137
6672 113
6671 129
6670 131
6669 132
6668 124
6667 129
6666 123
6665 128
6664 138
6663 118
6662 123
6661 127
6660 125
6659 126
6658 101
6657 112
6656 95
6655 131
6654 129
6653 110
6652 131
6651 104
6650 118
6649 121
6648 116
6647 118
6646 126
6645 112
6644 109
6643 119
6642 124
6641 123
6640 129
6639 142
6638 111
6637 136
6636 122
6635 138
6634 118
6633 140
6632 140
6631 167
6630 142
6629 139
6628 126
6627 166
6626 160
6625 186
6624 128
6623 125
6622 116
6621 121
6620 130
6619 122
6618 113
6617 129
6616 137
6615 140
6614 133
6613 121
6612 116
6611 134
6610 138
6609 122
6608 138
6607 123
6606 131
6605 156
6604 125
6603 126
6602 108
6601 123
6600 120
6599 125
6598 125
6597 182
6596 130
6595 131
6594 139
6593 130
6592 115
6591 126
6590 141
6589 124
6588 136
6587 109
6586 113
6585 116
6584 126
6583 103
6582 97
6581 133
6580 109
6579 109
6578 111
6577 128
6576 134
6575 118
6574 150
6573 128
6572 120
6571 110
6570 116
6569 116
6568 123
6567 141
6566 125
6565 127
6564 122
6563 145
6562 138
6561 116
6560 124
6559 137
6558 93
6557 110
6556 114
6555 127
6554 124
6553 126
6552 127
6551 127
6550 116
6549 116
6548 114
6547 129
6546 112
6545 113
6544 119
6543 106
6542 117
6541 215
6540 126
6539 130
6538 105
6537 116
6536 133
6535 128
6534 117
6533 122
6532 131
6531 116
6530 116
6529 123
6528 135
6527 127
6526 139
6525 116
6524 166
6523 131
6522 151
6521 150
6520 161
6519 158
6518 164
6517 148
6516 151
6515 151
6514 166
6513 139
6512 139
6511 130
6510 122
6509 125
6508 114
6507 127
6506 103
6505 111
6504 110
6503 124
6502 122
6501 110
6500 116
6499 129
6498 114
6497 144
6496 102
6495 119
6494 135
6493 134
6492 114
6491 119
6490 117
6489 126
6488 111
6487 116
6486 103
6485 111
6484 141
6483 125
6482 131
6481 147
6480 132
6479 138
6478 101
6477 133
6476 123
6475 130
6474 122
6473 122
6472 128
6471 129
6470 127
6469 123
6468 131
6467 118
6466 133
6465 121
6464 97
6463 120
6462 126
6461 117
6460 130
6459 131
6458 131
6457 130
6456 139
6455 138
6454 127
6453 128
6452 119
6451 154
6450 124
6449 140
6448 118
6447 123
6446 125
6445 120
6444 118
6443 140
6442 128
6441 132
6440 130
6439 123
6438 139
6437 111
6436 118
6435 154
6434 140
6433 141
6432 127
6431 113
6430 146
6429 130
6428 146
6427 136
6426 124
6425 119
6424 127
6423 118
6422 130
6421 146
6420 127
6419 131
6418 133
6417 139
6416 126
6415 118
6414 134
6413 136
6412 131
6411 122
6410 115
6409 139
6408 119
6407 125
6406 139
6405 132
6404 110
6403 132
6402 116
6401 115
6400 131
6399 106
6398 165
6397 117
6396 117
6395 127
6394 142
6393 110
6392 140
6391 127
6390 139
6389 134
6388 103
6387 116
6386 132
6385 127
6384 122
6383 120
6382 124
6381 126
6380 133
6379 113
6378 113
6377 141
6376 125
6375 127
6374 136
6373 120
6372 149
6371 123
6370 144
6369 111
6368 127
6367 128
6366 129
6365 131
6364 139
6363 145
6362 174
6361 117
6360 130
6359 119
6358 118
6357 116
6356 133
6355 123
6354 148
6353 133
6352 108
6351 121
6350 132
6349 127
6348 155
6347 119
6346 151
6345 122
6344 132
6343 145
6342 134
6341 134
6340 140
6339 111
6338 152
6337 128
6336 136
6335 133
6334 140
6333 126
6332 144
6331 131
6330 118
6329 125
6328 128
6327 126
6326 125
6325 112
6324 118
6323 128
6322 108
6321 142
6320 358
6319 157
6318 124
6317 123
6316 126
6315 118
6314 143
6313 95
6312 142
6311 121
6310 131
6309 123
6308 128
6307 112
6306 121
6305 123
6304 137
6303 125
6302 123
6301 120
6300 152
6299 118
6298 115
6297 122
6296 122
6295 135
6294 121
6293 125
6292 115
6291 126
6290 136
6289 139
6288 137
6287 124
6286 137
6285 133
6284 132
6283 108
6282 123
6281 128
6280 121
6279 142
6278 148
6277 118
6276 134
6275 132
6274 148
6273 117
6272 116
6271 136
6270 133
6269 145
6268 147
6267 136
6266 124
6265 158
6264 137
6263 154
6262 143
6261 133
6260 121
6259 135
6258 138
6257 161
6256 156
6255 122
6254 156
6253 135
6252 146
6251 131
6250 135
6249 108
6248 118
6247 132
6246 132
6245 162
6244 126
6243 138
6242 213
6241 124
6240 175
6239 450
6238 154
6237 130
6236 107
6235 147
6234 127
6233 122
6232 137
6231 124
6230 129
6229 117
6228 128
6227 165
6226 121
6225 159
6224 151
6223 122
6222 134
6221 125
6220 121
6219 121
6218 149
6217 133
6216 124
6215 130
6214 130
6213 128
6212 144
6211 127
6210 124
6209 140
6208 145
6207 128
6206 123
6205 138
6204 124
6203 159
6202 122
6201 136
6200 113
6199 129
6198 128
6197 120
6196 129
6195 133
6194 113
6193 132
6192 127
6191 146
6190 145
6189 121
6188 156
6187 137
6186 139
6185 137
6184 152
6183 129
6182 154
6181 120
6180 140
6179 134
6178 129
6177 123
6176 148
6175 133
6174 152
6173 151
6172 121
6171 138
6170 148
6169 145
6168 125
6167 121
6166 140
6165 144
6164 138
6163 114
6162 146
6161 139
6160 133
6159 153
6158 123
6157 141
6156 151
6155 129
6154 114
6153 135
6152 119
6151 136
6150 110
6149 125
6148 136
6147 144
6146 135
6145 138
6144 120
6143 117
6142 114
6141 124
6140 156
6139 128
6138 145
6137 111
6136 128
6135 138
6134 146
6133 127
6132 139
6131 149
6130 145
6129 140
6128 155
6127 131
6126 161
6125 143
6124 131
6123 142
6122 153
6121 142
6120 123
6119 138
6118 121
6117 137
6116 133
6115 128
6114 140
6113 143
6112 148
6111 156
6110 149
6109 146
6108 133
6107 136
6106 119
6105 130
6104 131
6103 132
6102 113
6101 148
6100 131
6099 147
6098 133
6097 139
6096 151
6095 134
6094 152
6093 153
6092 128
6091 118
6090 153
6089 137
6088 151
6087 118
6086 157
6085 138
6084 149
6083 136
6082 146
6081 132
6080 147
6079 124
6078 135
6077 137
6076 137
6075 159
6074 142
6073 133
6072 141
6071 146
6070 141
6069 132
6068 134
6067 116
6066 142
6065 154
6064 136
6063 131
6062 131
6061 133
6060 140
6059 128
6058 143
6057 139
6056 154
6055 147
6054 137
6053 134
6052 159
6051 143
6050 126
6049 159
6048 135
6047 138
6046 137
6045 144
6044 139
6043 153
6042 132
6041 122
6040 110
6039 138
6038 131
6037 152
6036 143
6035 130
6034 138
6033 154
6032 154
6031 154
6030 154
6029 164
6028 128
6027 144
6026 159
6025 145
6024 166
6023 126
6022 148
6021 127
6020 121
6019 146
6018 152
6017 146
6016 141
6015 121
6014 151
6013 146
6012 126
6011 134
6010 158
6009 149
6008 143
6007 143
6006 141
6005 128
6004 153
6003 138
6002 128
6001 138
6000 154
5999 158
5998 146
5997 151
5996 136
5995 145
5994 146
5993 128
5992 136
5991 152
5990 128
5989 134
5988 125
5987 135
5986 146
5985 155
5984 147
5983 130
5982 151
5981 135
5980 140
5979 142
5978 149
5977 144
5976 139
5975 140
5974 126
5973 120
5972 151
5971 142
5970 165
5969 145
5968 142
5967 136
5966 143
5965 167
5964 134
5963 138
5962 167
5961 129
5960 134
5959 139
5958 151
5957 143
5956 141
5955 159
5954 138
5953 147
5952 132
5951 149
5950 171
5949 140
5948 156
5947 153
5946 153
5945 143
5944 153
5943 128
5942 165
5941 129
5940 143
5939 163
5938 146
5937 142
5936 136
5935 159
5934 141
5933 158
5932 143
5931 143
5930 151
5929 131
5928 134
5927 161
5926 154
5925 167
5924 129
5923 169
5922 111
5921 129
5920 153
5919 131
5918 142
5917 143
5916 131
5915 148
5914 153
5913 138
5912 157
5911 163
5910 139
5909 141
5908 136
5907 132
5906 138
5905 140
5904 136
5903 146
5902 121
5901 142
5900 148
5899 149
5898 140
5897 140
5896 158
5895 139
5894 150
5893 155
5892 143
5891 144
5890 138
5889 163
5888 134
5887 151
5886 140
5885 147
5884 151
5883 127
5882 153
5881 140
5880 134
5879 166
5878 145
5877 177
5876 153
5875 144
5874 161
5873 134
5872 143
5871 165
5870 151
5869 127
5868 138
5867 147
5866 156
5865 156
5864 142
5863 153
5862 154
5861 157
5860 155
5859 148
5858 156
5857 142
5856 169
5855 167
5854 176
5853 133
5852 149
5851 140
5850 163
5849 139
5848 164
5847 159
5846 152
5845 155
5844 145
5843 170
5842 146
5841 174
5840 160
5839 153
5838 134
5837 128
5836 151
5835 135
5834 146
5833 149
5832 170
5831 150
5830 142
5829 160
5828 165
5827 142
5826 167
5825 159
5824 157
5823 154
5822 157
5821 153
5820 161
5819 154
5818 166
5817 178
5816 219
5815 196
5814 244
5813 186
5812 165
5811 180
5810 168
5809 133
5808 130
5807 153
5806 161
5805 150
5804 175
5803 146
5802 165
5801 144
5800 151
5799 157
5798 154
5797 147
5796 139
5795 150
5794 146
5793 142
5792 147
5791 159
5790 169
5789 150
5788 143
5787 172
5786 137
5785 149
5784 148
5783 152
5782 173
5781 152
5780 145
5779 118
5778 149
5777 139
5776 166
5775 154
5774 145
5773 170
5772 157
5771 144
5770 165
5769 174
5768 141
5767 159
5766 157
5765 163
5764 159
5763 157
5762 143
5761 155
5760 166
5759 154
5758 162
5757 159
5756 166
5755 148
5754 150
5753 149
5752 148
5751 162
5750 144
5749 168
5748 138
5747 155
5746 136
5745 169
5744 146
5743 167
5742 167
5741 144
5740 189
5739 170
5738 155
5737 152
5736 135
5735 160
5734 128
5733 164
5732 139
5731 167
5730 161
5729 189
5728 151
5727 170
5726 151
5725 140
5724 182
5723 155
5722 171
5721 159
5720 160
5719 148
5718 120
5717 153
5716 159
5715 154
5714 174
5713 182
5712 150
5711 160
5710 147
5709 157
5708 181
5707 141
5706 174
5705 173
5704 157
5703 144
5702 173
5701 141
5700 163
5699 154
5698 143
5697 177
5696 168
5695 195
5694 173
5693 148
5692 145
5691 146
5690 190
5689 162
5688 175
5687 155
5686 156
5685 148
5684 163
5683 171
5682 172
5681 179
5680 158
5679 161
5678 191
5677 157
5676 163
5675 161
5674 170
5673 144
5672 157
5671 156
5670 164
5669 163
5668 156
5667 174
5666 167
5665 139
5664 160
5663 145
5662 182
5661 159
5660 169
5659 183
5658 175
5657 156
5656 164
5655 168
5654 161
5653 167
5652 187
5651 197
5650 183
5649 179
5648 172
5647 160
5646 165
5645 143
5644 162
5643 170
5642 153
5641 171
5640 175
5639 179
5638 162
5637 147
5636 165
5635 183
5634 193
5633 179
5632 173
5631 168
5630 174
5629 187
5628 179
5627 198
5626 176
5625 190
5624 180
5623 177
5622 159
5621 155
5620 177
5619 166
5618 178
5617 167
5616 178
5615 171
5614 170
5613 160
5612 183
5611 159
5610 175
5609 189
5608 160
5607 190
5606 193
5605 159
5604 173
5603 185
5602 166
5601 162
5600 156
5599 179
5598 157
5597 171
5596 153
5595 144
5594 162
5593 196
5592 169
5591 175
5590 167
5589 169
5588 162
5587 167
5586 159
5585 175
5584 164
5583 145
5582 160
5581 143
5580 139
5579 174
5578 161
5577 203
5576 159
5575 179
5574 160
5573 166
5572 171
5571 192
5570 193
5569 139
5568 193
5567 161
5566 168
5565 159
5564 181
5563 184
5562 184
5561 175
5560 175
5559 158
5558 188
5557 185
5556 163
5555 159
5554 179
5553 177
5552 161
5551 181
5550 164
5549 164
5548 163
5547 159
5546 179
5545 195
5544 150
5543 188
5542 171
5541 181
5540 192
5539 177
5538 162
5537 206
5536 188
5535 164
5534 156
5533 147
5532 173
5531 200
5530 177
5529 155
5528 172
5527 166
5526 190
5525 181
5524 175
5523 179
5522 166
5521 180
5520 159
5519 180
5518 159
5517 171
5516 167
5515 165
5514 171
5513 164
5512 185
5511 182
5510 170
5509 171
5508 185
5507 165
5506 183
5505 168
5504 170
5503 189
5502 162
5501 159
5500 174
5499 180
5498 169
5497 185
5496 171
5495 165
5494 173
5493 175
5492 152
5491 161
5490 148
5489 175
5488 192
5487 161
5486 185
5485 192
5484 157
5483 159
5482 208
5481 150
5480 142
5479 185
5478 158
5477 168
5476 178
5475 163
5474 177
5473 179
5472 179
5471 198
5470 192
5469 167
5468 182
5467 196
5466 171
5465 182
5464 166
5463 199
5462 180
5461 179
5460 195
5459 167
5458 155
5457 191
5456 171
5455 195
5454 188
5453 185
5452 170
5451 178
5450 159
5449 165
5448 168
5447 157
5446 191
5445 157
5444 208
5443 185
5442 192
5441 191
5440 154
5439 187
5438 165
5437 179
5436 162
5435 200
5434 168
5433 185
5432 194
5431 165
5430 199
5429 173
5428 167
5427 180
5426 176
5425 188
5424 178
5423 195
5422 184
5421 186
5420 187
5419 161
5418 190
5417 172
5416 179
5415 186
5414 180
5413 215
5412 188
5411 190
5410 209
5409 155
5408 176
5407 192
5406 188
5405 178
5404 168
5403 184
5402 180
5401 154
5400 199
5399 183
5398 183
5397 173
5396 194
5395 181
5394 206
5393 183
5392 176
5391 214
5390 179
5389 192
5388 190
5387 189
5386 177
5385 168
5384 165
5383 165
5382 201
5381 180
5380 180
5379 187
5378 194
5377 183
5376 180
5375 197
5374 176
5373 195
5372 185
5371 159
5370 162
5369 193
5368 187
5367 175
5366 193
5365 164
5364 204
5363 181
5362 180
5361 190
5360 207
5359 180
5358 169
5357 169
5356 177
5355 212
5354 162
5353 177
5352 189
5351 180
5350 170
5349 182
5348 161
5347 173
5346 178
5345 189
5344 185
5343 178
5342 181
5341 196
5340 205
5339 203
5338 200
5337 177
5336 210
5335 177
5334 185
5333 184
5332 176
5331 196
5330 182
5329 181
5328 200
5327 179
5326 179
5325 210
5324 195
5323 181
5322 185
5321 206
5320 194
5319 198
5318 197
5317 202
5316 184
5315 194
5314 210
5313 203
5312 183
5311 195
5310 192
5309 207
5308 190
5307 190
5306 215
5305 196
5304 221
5303 213
5302 206
5301 170
5300 192
5299 191
5298 187
5297 217
5296 174
5295 199
5294 213
5293 191
5292 177
5291 165
5290 190
5289 197
5288 186
5287 179
5286 180
5285 192
5284 202
5283 184
5282 191
5281 208
5280 201
5279 187
5278 180
5277 198
5276 213
5275 214
5274 223
5273 211
5272 178
5271 196
5270 178
5269 173
5268 212
5267 222
5266 188
5265 198
5264 198
5263 204
5262 198
5261 183
5260 197
5259 196
5258 189
5257 194
5256 233
5255 200
5254 208
5253 210
5252 214
5251 204
5250 214
5249 186
5248 202
5247 185
5246 194
5245 188
5244 198
5243 192
5242 181
5241 181
5240 212
5239 209
5238 217
5237 217
5236 199
5235 184
5234 188
5233 182
5232 187
5231 200
5230 179
5229 209
5228 207
5227 187
5226 185
5225 204
5224 220
5223 198
5222 217
5221 180
5220 196
5219 200
5218 186
5217 227
5216 202
5215 203
5214 180
5213 201
5212 210
5211 196
5210 201
5209 211
5208 202
5207 179
5206 199
5205 191
5204 176
5203 235
5202 203
5201 194
5200 216
5199 197
5198 233
5197 188
5196 212
5195 218
5194 218
5193 247
5192 179
5191 218
5190 186
5189 193
5188 201
5187 195
5186 179
5185 219
5184 205
5183 200
5182 193
5181 176
5180 196
5179 201
5178 190
5177 185
5176 189
5175 179
5174 241
5173 204
5172 207
5171 200
5170 232
5169 202
5168 207
5167 202
5166 225
5165 215
5164 252
5163 228
5162 186
5161 176
5160 226
5159 215
5158 186
5157 220
5156 196
5155 199
5154 229
5153 213
5152 207
5151 194
5150 216
5149 213
5148 227
5147 223
5146 221
5145 246
5144 210
5143 167
5142 230
5141 193
5140 220
5139 192
5138 228
5137 232
5136 183
5135 211
5134 204
5133 214
5132 193
5131 201
5130 194
5129 213
5128 224
5127 233
5126 196
5125 193
5124 206
5123 242
5122 196
5121 212
5120 230
5119 231
5118 215
5117 207
5116 228
5115 203
5114 206
5113 194
5112 189
5111 215
5110 215
5109 188
5108 206
5107 221
5106 222
5105 228
5104 203
5103 210
5102 217
5101 212
5100 221
5099 204
5098 210
5097 192
5096 181
5095 206
5094 195
5093 213
5092 191
5091 212
5090 205
5089 188
5088 204
5087 215
5086 203
5085 196
5084 215
5083 230
5082 216
5081 208
5080 215
5079 214
5078 195
5077 225
5076 231
5075 197
5074 212
5073 205
5072 220
5071 217
5070 205
5069 233
5068 241
5067 243
5066 191
5065 203
5064 209
5063 219
5062 237
5061 249
5060 266
5059 215
5058 212
5057 198
5056 205
5055 227
5054 222
5053 221
5052 198
5051 253
5050 189
5049 202
5048 212
5047 184
5046 222
5045 307
5044 207
5043 200
5042 198
5041 216
5040 216
5039 202
5038 214
5037 248
5036 255
5035 216
5034 203
5033 199
5032 215
5031 217
5030 204
5029 203
5028 216
5027 218
5026 223
5025 212
5024 225
5023 230
5022 241
5021 198
5020 242
5019 194
5018 232
5017 209
5016 197
5015 220
5014 207
5013 179
5012 217
5011 216
5010 231
5009 217
5008 242
5007 209
5006 219
5005 233
5004 212
5003 188
5002 191
5001 220
5000 215
4999 220
4998 240
4997 215
4996 241
4995 197
4994 219
4993 243
4992 213
4991 211
4990 226
4989 228
4988 221
4987 230
4986 195
4985 240
4984 213
4983 227
4982 215
4981 220
4980 231
4979 193
4978 192
4977 218
4976 209
4975 202
4974 212
4973 203
4972 201
4971 228
4970 220
4969 215
4968 250
4967 231
4966 206
4965 203
4964 220
4963 229
4962 189
4961 209
4960 210
4959 210
4958 218
4957 237
4956 222
4955 221
4954 212
4953 225
4952 246
4951 214
4950 216
4949 227
4948 236
4947 194
4946 247
4945 221
4944 207
4943 194
4942 226
4941 235
4940 202
4939 242
4938 214
4937 219
4936 250
4935 202
4934 233
4933 223
4932 232
4931 228
4930 236
4929 186
4928 209
4927 225
4926 225
4925 209
4924 205
4923 239
4922 249
4921 210
4920 213
4919 220
4918 201
4917 234
4916 234
4915 225
4914 242
4913 203
4912 186
4911 221
4910 207
4909 204
4908 237
4907 213
4906 219
4905 214
4904 238
4903 217
4902 206
4901 195
4900 250
4899 208
4898 234
4897 219
4896 212
4895 222
4894 245
4893 198
4892 231
4891 238
4890 224
4889 231
4888 215
4887 230
4886 214
4885 218
4884 233
4883 211
4882 223
4881 202
4880 236
4879 242
4878 215
4877 222
4876 217
4875 192
4874 221
4873 209
4872 211
4871 220
4870 237
4869 236
4868 214
4867 245
4866 244
4865 240
4864 202
4863 233
4862 227
4861 222
4860 221
4859 231
4858 251
4857 217
4856 238
4855 246
4854 220
4853 235
4852 227
4851 248
4850 212
4849 234
4848 215
4847 217
4846 203
4845 198
4844 185
4843 199
4842 207
4841 215
4840 210
4839 219
4838 186
4837 220
4836 224
4835 207
4834 197
4833 240
4832 197
4831 214
4830 233
4829 232
4828 224
4827 209
4826 202
4825 216
4824 229
4823 219
4822 212
4821 209
4820 199
4819 212
4818 217
4817 222
4816 215
4815 233
4814 223
4813 222
4812 251
4811 234
4810 249
4809 231
4808 226
4807 200
4806 220
4805 235
4804 211
4803 210
4802 219
4801 228
4800 213
4799 226
4798 218
4797 253
4796 223
4795 237
4794 208
4793 245
4792 221
4791 222
4790 245
4789 243
4788 199
4787 207
4786 249
4785 218
4784 222
4783 238
4782 227
4781 200
4780 263
4779 226
4778 229
4777 236
4776 222
4775 244
4774 242
4773 222
4772 244
4771 220
4770 216
4769 210
4768 227
4767 233
4766 208
4765 223
4764 224
4763 229
4762 231
4761 228
4760 214
4759 212
4758 226
4757 212
4756 212
4755 221
4754 237
4753 226
4752 244
4751 218
4750 216
4749 218
4748 226
4747 245
4746 220
4745 252
4744 221
4743 261
4742 242
4741 263
4740 207
4739 235
4738 255
4737 251
4736 214
4735 233
4734 232
4733 222
4732 251
4731 244
4730 233
4729 230
4728 239
4727 227
4726 229
4725 252
4724 224
4723 226
4722 238
4721 211
4720 229
4719 240
4718 241
4717 221
4716 228
4715 224
4714 221
4713 247
4712 239
4711 210
4710 228
4709 240
4708 244
4707 211
4706 219
4705 235
4704 250
4703 210
4702 219
4701 239
4700 257
4699 223
4698 228
4697 237
4696 247
4695 215
4694 224
4693 259
4692 247
4691 236
4690 233
4689 238
4688 229
4687 222
4686 264
4685 220
4684 226
4683 235
4682 225
4681 235
4680 223
4679 231
4678 233
4677 250
4676 233
4675 263
4674 226
4673 219
4672 246
4671 228
4670 236
4669 238
4668 267
4667 222
4666 228
4665 233
4664 230
4663 238
4662 244
4661 248
4660 228
4659 248
4658 237
4657 204
4656 243
4655 220
4654 232
4653 249
4652 223
4651 240
4650 250
4649 236
4648 247
4647 255
4646 250
4645 237
4644 242
4643 238
4642 247
4641 217
4640 221
4639 208
4638 221
4637 230
4636 206
4635 250
4634 228
4633 200
4632 234
4631 250
4630 226
4629 241
4628 231
4627 259
4626 230
4625 248
4624 236
4623 218
4622 218
4621 239
4620 211
4619 231
4618 217
4617 239
4616 261
4615 221
4614 236
4613 223
4612 240
4611 247
4610 252
4609 235
4608 222
4607 253
4606 243
4605 215
4604 231
4603 265
4602 259
4601 227
4600 245
4599 234
4598 268
4597 238
4596 240
4595 223
4594 237
4593 242
4592 243
4591 247
4590 254
4589 242
4588 256
4587 265
4586 250
4585 218
4584 238
4583 241
4582 210
4581 230
4580 250
4579 221
4578 237
4577 256
4576 232
4575 220
4574 246
4573 250
4572 208
4571 253
4570 233
4569 249
4568 232
4567 212
4566 250
4565 249
4564 226
4563 227
4562 249
4561 212
4560 222
4559 222
4558 228
4557 261
4556 269
4555 261
4554 215
4553 272
4552 235
4551 247
4550 271
4549 225
4548 241
4547 241
4546 244
4545 250
4544 241
4543 261
4542 249
4541 245
4540 259
4539 229
4538 252
4537 274
4536 239
4535 236
4534 265
4533 238
4532 242
4531 228
4530 224
4529 234
4528 226
4527 263
4526 224
4525 239
4524 253
4523 264
4522 255
4521 251
4520 279
4519 274
4518 218
4517 228
4516 228
4515 235
4514 246
4513 262
4512 240
4511 230
4510 248
4509 254
4508 251
4507 249
4506 253
4505 236
4504 249
4503 213
4502 242
4501 269
4500 253
4499 240
4498 231
4497 259
4496 228
4495 232
4494 218
4493 258
4492 218
4491 251
4490 244
4489 273
4488 248
4487 236
4486 231
4485 215
4484 252
4483 261
4482 247
4481 232
4480 250
4479 254
4478 227
4477 237
4476 266
4475 281
4474 252
4473 296
4472 276
4471 233
4470 214
4469 238
4468 260
4467 253
4466 252
4465 265
4464 243
4463 245
4462 250
4461 245
4460 239
4459 232
4458 242
4457 231
4456 234
4455 262
4454 212
4453 232
4452 259
4451 236
4450 246
4449 270
4448 266
4447 243
4446 257
4445 271
4444 245
4443 236
4442 206
4441 229
4440 258
4439 248
4438 262
4437 268
4436 222
4435 264
4434 274
4433 276
4432 249
4431 226
4430 232
4429 256
4428 238
4427 244
4426 247
4425 260
4424 239
4423 245
4422 246
4421 272
4420 246
4419 267
4418 243
4417 238
4416 275
4415 256
4414 252
4413 284
4412 245
4411 277
4410 237
4409 249
4408 296
4407 243
4406 242
4405 284
4404 252
4403 272
4402 278
4401 240
4400 310
4399 238
4398 253
4397 232
4396 278
4395 290
4394 274
4393 421
4392 268
4391 231
4390 263
4389 226
4388 266
4387 233
4386 241
4385 256
4384 245
4383 266
4382 279
4381 245
4380 246
4379 268
4378 243
4377 261
4376 276
4375 241
4374 283
4373 251
4372 256
4371 245
4370 257
4369 255
4368 276
4367 287
4366 268
4365 266
4364 249
4363 254
4362 245
4361 307
4360 246
4359 481
4358 238
4357 255
4356 279
4355 269
4354 246
4353 271
4352 268
4351 271
4350 259
4349 270
4348 255
4347 264
4346 256
4345 288
4344 254
4343 267
4342 244
4341 253
4340 253
4339 281
4338 257
4337 307
4336 257
4335 549
4334 269
4333 261
4332 250
4331 257
4330 247
4329 231
4328 282
4327 240
4326 283
4325 265
4324 254
4323 231
4322 263
4321 243
4320 271
4319 286
4318 287
4317 334
4316 271
4315 253
4314 256
4313 264
4312 281
4311 266
4310 287
4309 249
4308 259
4307 294
4306 263
4305 317
4304 249
4303 247
4302 233
4301 259
4300 276
4299 278
4298 305
4297 273
4296 261
4295 244
4294 278
4293 275
4292 279
4291 264
4290 288
4289 271
4288 279
4287 284
4286 245
4285 262
4284 273
4283 264
4282 269
4281 268
4280 279
4279 277
4278 268
4277 290
4276 245
4275 272
4274 266
4273 274
4272 280
4271 287
4270 255
4269 255
4268 255
4267 262
4266 256
4265 261
4264 283
4263 275
4262 272
4261 254
4260 276
4259 277
4258 288
4257 254
4256 284
4255 265
4254 264
4253 288
4252 284
4251 262
4250 264
4249 277
4248 274
4247 294
4246 284
4245 264
4244 278
4243 247
4242 256
4241 269
4240 261
4239 284
4238 293
4237 248
4236 261
4235 279
4234 257
4233 294
4232 263
4231 251
4230 253
4229 279
4228 293
4227 278
4226 261
4225 258
4224 254
4223 279
4222 297
4221 278
4220 274
4219 285
4218 272
4217 287
4216 251
4215 258
4214 281
4213 264
4212 284
4211 273
4210 268
4209 281
4208 240
4207 310
4206 282
4205 248
4204 261
4203 289
4202 268
4201 262
4200 266
4199 284
4198 258
4197 254
4196 298
4195 257
4194 291
4193 278
4192 285
4191 267
4190 286
4189 284
4188 271
4187 311
4186 266
4185 271
4184 301
4183 253
4182 272
4181 277
4180 273
4179 265
4178 301
4177 272
4176 282
4175 267
4174 252
4173 278
4172 275
4171 282
4170 292
4169 265
